amamory/stm32f10x_makefile_freertos/RadioHead-1.97/RadioHead.h
// RadioHead.h
// Author: Mike McCauley (mikem@airspayce.com) DO NOT CONTACT THE AUTHOR DIRECTLY
// Copyright (C) 2014 Mike McCauley
// $Id: RadioHead.h,v 1.78 2019/09/06 04:40:40 mikem Exp mikem $

/*! \mainpage RadioHead Packet Radio library for embedded microprocessors

This is the RadioHead Packet Radio library for embedded microprocessors.
It provides a complete object-oriented library for sending and receiving packetized messages
via a variety of common data radios and other transports on a range of embedded microprocessors.

The version of the package that this documentation refers to can be downloaded
from http://www.airspayce.com/mikem/arduino/RadioHead/RadioHead-1.97.zip
You can find the latest version of the documentation at http://www.airspayce.com/mikem/arduino/RadioHead

You can also find online help and discussion at
http://groups.google.com/group/radiohead-arduino
Please use that group for all questions and discussions on this topic.
Do not contact the author directly, unless it is to discuss commercial licensing.
Before asking a question or reporting a bug, please read
- http://en.wikipedia.org/wiki/Wikipedia:Reference_desk/How_to_ask_a_software_question
- http://www.catb.org/esr/faqs/smart-questions.html
- http://www.chiark.greenend.org.uk/~shgtatham/bugs.html

Caution: Developing this type of software and using data radios
successfully is challenging and requires a substantial knowledge
base in software and radio and data transmission technologies and
theory.  It may not be an appropriate project for beginners. If
you are a beginner, you will need to spend some time gaining
knowledge in these areas first.

\par Overview

RadioHead consists of 2 main sets of classes: Drivers and Managers.

- Drivers provide low level access to a range of different packet radios and other packetized message transports.
- Managers provide high level message sending and receiving facilities for a range of different requirements.

Every RadioHead program will have an instance of a Driver to
provide access to the data radio or transport, and usually a
Manager that uses that driver to send and receive messages for the
application. The programmer is required to instantiate a Driver
and a Manager, and to initialise the Manager. Thereafter the
facilities of the Manager can be used to send and receive
messages.

It is also possible to use a Driver on its own, without a Manager, although this only allows unaddressed,
unreliable transport via the Driver's facilities.

In some specialised use cases, it is possible to instantiate more than one Driver and more than one Manager.

A range of different common embedded microprocessor platforms are supported, allowing your project to run
on your choice of processor.

Example programs are included to show the main modes of use.

\par Drivers

The following Drivers are provided:

- RH_RF22
Works with Hope-RF
RF22B and RF23B based transceivers, and compatible chips and modules,
including the RFM22B transceiver module such as
hthis bare module: http://www.sparkfun.com/products/10153
and this shield: http://www.sparkfun.com/products/11018
and this board: http://www.anarduino.com/miniwireless
and RF23BP modules such as: http://www.anarduino.com/details.jsp?pid=130
Supports GFSK, FSK and OOK. Access to other chip
features such as on-chip temperature measurement, analog-digital
converter, transmitter power control etc is also provided.

- RH_RF24
Works with Silicon Labs Si4460/4461/4463/4464 family of transceivers chip, and the equivalent
HopeRF RF24/26/27 family of chips and the HopeRF RFM24W/26W/27W modules.
Supports GFSK, FSK and OOK. Access to other chip
features such as on-chip temperature measurement, analog-digital
converter, transmitter power control etc is also provided.

- RH_RF69
Works with Hope-RF
RF69B based radio modules, such as the RFM69 module, (as used on the excellent Moteino and Moteino-USB
boards from LowPowerLab http://lowpowerlab.com/moteino/ )
and compatible chips and modules such as RFM69W, RFM69HW, RFM69CW, RFM69HCW (Semtech SX1231, SX1231H).
Also works with Anarduino MiniWireless -CW and -HW boards http://www.anarduino.com/miniwireless/ including
the marvellous high powered MinWireless-HW (with 20dBm output for excellent range).
Supports GFSK, FSK.

- RH_NRF24
Works with Nordic nRF24 based 2.4GHz radio modules, such as nRF24L01 and others.
Also works with Hope-RF RFM73
and compatible devices (such as BK2423). nRF24L01 and RFM73 can interoperate
with each other.

- RH_NRF905
Works with Nordic nRF905 based 433/868/915 MHz radio modules.

- RH_NRF51
Works with Nordic nRF51 compatible 2.4 GHz SoC/devices such as the nRF51822.
Also works with Sparkfun nRF52832 breakout board, with Arduino 1.6.13 and
Sparkfun nRF52 boards manager 0.2.3. Caution: although RadioHead compiles with nRF52832 as at 2019-06-06
there appears to be a problem with the support of interupt handlers in the Sparkfun support libraries,
and drivers (ie most of the SPI based radio drivers) that require interrupts do not work correctly.

- RH_RF95
Works with Semtech SX1276/77/78/79, Modtronix inAir4 and inAir9,
and HopeRF RFM95/96/97/98 and other similar LoRa capable radios.
Supports Long Range (LoRa) with spread spectrum frequency hopping, large payloads etc.
FSK/GFSK/OOK modes are not (yet) supported.

- RH_MRF89
Works with Microchip MRF89XA and compatible transceivers.
and modules such as MRF89XAM9A.

- RH_CC110
Works with Texas Instruments CC110L transceivers and compatible modules such as
Anaren AIR BoosterPack 430BOOST-CC110L

- RH_E32
Works with EBYTE E32-TTL-1W serial radio transceivers (and possibly other transceivers in the same family)

- RH_ASK
Works with a range of inexpensive ASK (amplitude shift keying) RF transceivers such as RX-B1
(also known as ST-RX04-ASK) receiver; TX-C1 transmitter and DR3100 transceiver; FS1000A/XY-MK-5V transceiver;
HopeRF RFM83C / RFM85. Supports ASK (OOK).

- RH_Serial
Works with RS232, RS422, RS485, RS488 and other point-to-point and multidropped serial connections,
or with TTL serial UARTs such as those on Arduino and many other processors,
or with data radios with a
serial port interface. RH_Serial provides packetization and error detection over any hardware or
virtual serial connection. Also builds and runs on Linux and OSX.

