amamory/stm32f10x_makefile_freertos/RadioHead-1.97/RadioHead.h
- RH_TCP
For use with simulated sketches compiled and running on Linux.
Works with tools/etherSimulator.pl to pass messages between simulated sketches, allowing
testing of Manager classes on Linux and without need for real radios or other transport hardware.

- RHEncryptedDriver
Adds encryption and decryption to any RadioHead transport driver, using any encrpytion cipher
supported by ArduinoLibs Cryptographic Library http://rweather.github.io/arduinolibs/crypto.html

Drivers can be used on their own to provide unaddressed, unreliable datagrams.
All drivers have the same identical API.
Or you can use any Driver with any of the Managers described below.

We welcome contributions of well tested and well documented code to support other transports.

If your radio or transciever is not on the list above, there is a good chance it
wont work without modifying RadioHead to suit it.  If you wish for
support for another radio or transciever, and you send 2 of them to
AirSpayce Pty Ltd, we will consider adding support for it.

\par Managers

The drivers above all provide for unaddressed, unreliable, variable
length messages, but if you need more than that, the following
Managers are provided:

- RHDatagram
Addressed, unreliable variable length messages, with optional broadcast facilities.

- RHReliableDatagram
Addressed, reliable, retransmitted, acknowledged variable length messages.

- RHRouter
Multi-hop delivery of RHReliableDatagrams from source node to destination node via 0 or more
intermediate nodes, with manual, pre-programmed routing.

- RHMesh
Multi-hop delivery of RHReliableDatagrams with automatic route discovery and rediscovery.

Any Manager may be used with any Driver.

\par Platforms

A range of processors and platforms are supported:

- Arduino and the Arduino IDE (version 1.0 to 1.8.1 and later)
Including Diecimila, Uno, Mega, Leonardo, Yun, Due, Zero etc. http://arduino.cc/, Also similar boards such as
 - Moteino http://lowpowerlab.com/moteino/
 - Anarduino Mini http://www.anarduino.com/mini/
 - RedBearLab Blend V1.0 http://redbearlab.com/blend/ (with Arduino 1.0.5 and RedBearLab Blend Add-On version 20140701)
 -  MoteinoMEGA https://lowpowerlab.com/shop/moteinomega
    (with Arduino 1.0.5 and the MoteinoMEGA Arduino Core
    https://github.com/LowPowerLab/Moteino/tree/master/MEGA/Core)
 - ESP8266 on Arduino IDE and Boards Manager per https://github.com/esp8266/Arduino
   Tested using Arduino 1.6.8 with esp8266 by ESP8266 Community version 2.1.0
   Also Arduino 1.8.1 with esp8266 by SparkFun Electronics 2.5.2
   Examples serial_reliable_datagram_* and ask_* are shown to work.
   CAUTION: The GHz radio included in the ESP8266 is
   not yet supported.
   CAUTION: tests here show that when powered by an FTDI USB-Serial converter,
   the ESP8266 can draw so much power when transmitting on its GHz WiFi that VCC will sag
   causing random crashes. We strongly recommend a large cap, say 1000uF 10V on VCC if you are also using the WiFi.
 - Various Talk2 Whisper boards eg https://wisen.com.au/store/products/whisper-node-lora.
   Use Arduino Board Manager to install the Talk2 code support.
 - etc.

- STM32 F4 Discover board, using Arduino 1.8.2 or later and
   Roger Clarkes Arduino_STM from https://github.com/rogerclarkmelbourne/Arduino_STM32
   Caution: with this library and board, sending text to Serial causes the board to hang in mysterious ways.
   Serial2 emits to PA2. The default SPI pins are SCK: PB3, MOSI PB5, MISO PB4.
   We tested with PB0 as slave select and PB1 as interrupt pin for various radios. RH_ASK and RH_Serial also work.

- ChipKIT Core with Arduino IDE on any ChipKIT Core supported Digilent processor (tested on Uno32)
  http://chipkit.net/wiki/index.php?title=ChipKIT_core

- Maple and Flymaple boards with libmaple and the Maple-IDE development environment
  http://leaflabs.com/devices/maple/ and http://www.open-drone.org/flymaple

- Teensy including Teensy 3.1 and earlier built using Arduino IDE 1.0.5 to 1.6.4 and later with
  teensyduino addon 1.18 to 1.23 and later.
  http://www.pjrc.com/teensy

- Particle Photon https://store.particle.io/collections/photon and ARM3 based CPU with built-in
  Wi-Fi transceiver and extensive IoT software suport. RadioHead does not support the built-in transceiver
  but can be used to control other SPI based radios, Serial ports etc.
  See below for details on how to build RadioHead for Photon

- ATTiny built using Arduino IDE 1.8 and the ATTiny core from
  https://raw.githubusercontent.com/damellis/attiny/ide-1.6.x-boards-manager/package_damellis_attiny_index.json
  using the instructions at
  https://medium.com/jungletronics/attiny85-easy-flashing-through-arduino-b5f896c48189
  (Caution: these are very small processors and not all RadioHead features may be available, depending on memory requirements)
  (Caution: we have not had good success building RH_ASK sketches for ATTiny 85  with SpenceKonde ATTinyCore)

- nRF51 compatible Arm chips such as nRF51822 with Arduino 1.6.4 and later using the procedures
  in http://redbearlab.com/getting-started-nrf51822/

- nRF52 compatible Arm chips such as as Adafruit BLE Feather board
  https://www.adafruit.com/product/3406

- Adafruit Feather. These are excellent boards that are available with a variety of radios. We tested with the
  Feather 32u4 with RFM69HCW radio, with Arduino IDE 1.6.8 and the Adafruit AVR Boards board manager version 1.6.10.
  https://www.adafruit.com/products/3076

- Adafruit Feather M0 boards with Arduino 1.8.1 and later, using the Arduino and Adafruit SAMD board support.
  https://learn.adafruit.com/adafruit-feather-m0-basic-proto/using-with-arduino-ide

- ESP32 built using Arduino IDE 1.8.9 or later using the ESP32 toolchain installed per
  https://github.com/espressif/arduino-esp32
  The internal 2.4GHz radio is not yet supported. Tested with RFM22 using SPI interface

- Raspberry Pi
  Uses BCM2835 library for GPIO http://www.airspayce.com/mikem/bcm2835/
  Currently works only with RH_NRF24 driver or other drivers that do not require interrupt support.
  Contributed by Mike Poublon.

- Linux and OSX
  Using the RHutil/HardwareSerial class, the RH_Serial driver and any manager will
  build and run on Linux and OSX. These can be used to build programs that talk securely and reliably to
  Arduino and other processors or to other Linux or OSX hosts on a reliable, error detected (and possibly encrypted) datagram
  protocol over various types of serial line.

- Mongoose OS, courtesy Paul Austen. Mongoose OSis an Internet of Things Firmware Development Framework
  available under Apache License Version 2.0. It supports low power, connected microcontrollers such as:
  ESP32, ESP8266, TI CC3200, TI CC3220, STM32.
  https://mongoose-os.com/

