amamory/stm32f10x_makefile_freertos/RadioHead-1.97/RadioHead.h
\par Copyright

This software is Copyright (C) 2011-2018 Mike McCauley. Use is subject to license
conditions. The main licensing options available are GPL V2 or Commercial:

\par Open Source Licensing GPL V2

This is the appropriate option if you want to share the source code of your
application with everyone you distribute it to, and you also want to give them
the right to share who uses it. If you wish to use this software under Open
Source Licensing, you must contribute all your source code to the open source
community in accordance with the GPL Version 2 when your application is
distributed. See https://www.gnu.org/licenses/gpl-2.0.html

\par Commercial Licensing

This is the appropriate option if you are creating proprietary applications
and you are not prepared to distribute and share the source code of your
application. To purchase a commercial license, contact info@airspayce.com

\par Revision History
\version 1.1 2014-04-14<br>
             Initial public release
\version 1.2 2014-04-23<br>
             Fixed various typos. <br>
             Added links to compatible Anarduino products.<br>
             Added RHNRFSPIDriver, RH_NRF24 classes to support Nordic NRF24 based radios.
\version 1.3 2014-04-28<br>
             Various documentation fixups.<br>
             RHDatagram::setThisAddress() did not set the local copy of thisAddress. Reported by Steve Childress.<br>
             Fixed a problem on Teensy with RF22 and RF69, where the interrupt pin needs to be set for input, <br>
             else pin interrupt doesn't work properly. Reported by Steve Childress and patched by
             Adrien van den Bossche. Thanks.<br>
             Fixed a problem that prevented RF22 honouring setPromiscuous(true). Reported by Steve Childress.<br>
             Updated documentation to clarify some issues to do with maximum message lengths
             reported by Steve Childress.<br>
             Added support for yield() on systems that support it (currently Arduino 1.5.5 and later)
             so that spin-loops can suport multitasking. Suggested by Steve Childress.<br>
             Added RH_RF22::setGpioReversed() so the reversal it can be configured at run-time after
             radio initialisation. It must now be called _after_ init(). Suggested by Steve Childress.<br>
\version 1.4 2014-04-29<br>
             Fixed further problems with Teensy compatibility for RH_RF22. Tested on Teensy 3.1.
             The example/rf22_* examples now run out of the box with the wiring connections as documented for Teensy
             in RH_RF22.<br>
             Added YIELDs to spin-loops in RHRouter, RHMesh and RHReliableDatagram, RH_NRF24.<br>
             Tested RH_Serial examples with Teensy 3.1: they now run out of the box.<br>
             Tested RH_ASK examples with Teensy 3.1: they now run out of the box.<br>
             Reduced default SPI speed for NRF24 from 8MHz to 1MHz on Teensy, to improve reliability when
             poor wiring is in use.<br>
             on some devices such as Teensy.<br>
             Tested RH_NRF24 examples with Teensy 3.1: they now run out of the box.<br>
\version 1.5 2014-04-29<br>
             Added support for Nordic Semiconductor nRF905 transceiver with RH_NRF905 driver. Also
             added examples for nRF905 and tested on Teensy 3.1
\version 1.6 2014-04-30<br>
             NRF905 examples were missing
\version 1.7 2014-05-03<br>
             Added support for Arduino Due. Tested with RH_NRF905, RH_Serial, RH_ASK.
             IMPORTANT CHANGE to interrupt pins on Arduino with RH_RF22 and RH_RF69 constructors:
             previously, you had to specify the interrupt _number_ not the interrupt _pin_. Arduinos and Uno32
             are now consistent with all other platforms: you must specify the interrupt pin number. Default
             changed to pin 2 (a common choice with RF22 shields).
             Removed examples/maple/maple_rf22_reliable_datagram_client and
             examples/maple/maple_rf22_reliable_datagram_client since the rf22 examples now work out
             of the box with Flymaple.
             Removed examples/uno32/uno32_rf22_reliable_datagram_client and
             examples/uno32/uno32_rf22_reliable_datagram_client since the rf22 examples now work out
             of the box with ChipKit Uno32.
\version 1.8 2014-05-08 <br>
             Added support for YIELD in Teensy 2 and 3, suggested by Steve Childress.<br>
             Documentation updates. Clarify use of headers and Flags<br>
             Fixed misalignment in RH_RF69 between ModemConfigChoice definitions and the implemented choices
             which meant you didnt get the choice you thought and GFSK_Rb55555Fd50 hung the transmitter.<br>
             Preliminary work on Linux simulator.
\version 1.9 2014-05-14 <br>
             Added support for using Timer 2 instead of Timer 1 on Arduino in RH_ASK when
             RH_ASK_ARDUINO_USE_TIMER2 is defined. With the kind assistance of
             Luc Small. Thanks!<br>
             Updated comments in RHReliableDatagram concerning servers, retries, timeouts and delays.
             Fixed an error in RHReliableDatagram where recvfrom return value was not checked.
             Reported by Steve Childress.<br>
             Added Linux simulator support so simple RadioHead sketches can be compiled and run on Linux.<br>
             Added RH_TCP driver to permit message passing between simulated sketches on Linux.<br>
             Added example simulator sketches.<br>
             Added tools/etherSimulator.pl, a simulator of the 'Luminiferous Ether' that passes
             messages between simulated sketches and can simulate random message loss etc.<br>
             Fixed a number of typos and improved some documentation.<br>
\version 1.10 2014-05-15 <br>
             Added support for RFM73 modules to RH_NRF24. These 2 radios are very similar, and can interoperate
             with each other. Added new RH_NRF24::TransmitPower enums for the RFM73, which has a different
             range of available powers<br>
             reduced the default SPI bus speed for RH_NRF24 to 1MHz, since so many modules and CPU have problems
             with 8MHz.<br>
\version 1.11 2014-05-18<br>
             Testing RH_RF22 with RFM23BP and 3.3V Teensy 3.1 and 5V Arduinos.
             Updated documentation with respect to GPIO and antenna
             control pins for RFM23. Updated documentation with respect to transmitter power control for RFM23<br>
             Fixed a problem with RH_RF22 driver, where GPIO TX and RX pins were not configured during
             initialisation, causing poor transmit power and sensitivity on those RF22/RF23 devices where GPIO controls
             the antenna selection pins.
\version 1.12 2014-05-20<br>
             Testing with RF69HW and the RH_RF69 driver. Works well with the Anarduino MiniWireless -CW and -HW
             boards http://www.anarduino.com/miniwireless/ including
             the marvellous high powered MinWireless-HW (with 20dBm output for excellent range).<br>
             Clarified documentation of RH_RF69::setTxPower values for different models of RF69.<br>
             Added RHReliableDatagram::resetRetransmissions().<br>
             Retransmission count precision increased to uin32_t.<br>
             Added data about actual power measurements from RFM22 module.<br>
\version 1.13 2014-05-23<br>
             setHeaderFlags(flags) changed to setHeaderFlags(set, clear), enabling any flags to be
             individually set and cleared by either RadioHead or application code. Requested by Steve Childress.<br>
             Fixed power output setting for boost power on RF69HW for 18, 19 and 20dBm.<br>
             Added data about actual power measurements from RFM69W and RFM69HW modules.<br>
\version 1.14 2014-05-26<br>
             RH_RF69::init() now always sets the PA boost back to the default settings, else can get invalid
             PA power modes after uploading new sketches without a power cycle. Reported by Bryan.<br>
             Added new macros RH_VERSION_MAJOR RH_VERSION_MINOR, with automatic maintenance in Makefile.<br>
             Improvements to RH_TCP: constructor now honours the server argument in the form "servername:port".<br>
             Added YIELD to RHReliableDatagram::recvfromAckTimeout. Requested by Steve Childress.<br>
             Fixed a problem with RH_RF22 reliable datagram acknowledgements that was introduced in version 1.13.
             Reported by Steve Childress.<br>
\version 1.15 2014-05-27<br>
             Fixed a problem with the RadioHead .zip link.
\version 1.16 2014-05-30 <br>
             Fixed RH_RF22 so that lastRssi() returns the signal strength in dBm. Suggested by Steve Childress.<br>
             Added support for getLastPreambleTime() to RH_RF69. Requested by Steve Childress.<br>
             RH_NRF24::init() now checks if there is a device connected and responding, else init() will fail.
             Suggested by Steve Brown.<br>
             RHSoftwareSPI now initialises default values for SPI pins MOSI = 12, MISO = 11 and SCK = 13.<br>
             Fixed some problems that prevented RH_NRF24 working with mixed software and hardware SPI
             on different devices: a race condition
             due to slow SPI transfers and fast acknowledgement.<br>
\version 1.17 2014-06-02 <br>
             Fixed a debug typo in RHReliableDatagram that was introduced in 1.16.<br>
             RH_NRF24 now sets default power, data rate and channel in init(), in case another
             app has previously set different values without powerdown.<br>
             Caution: there are still problems with RH_NRF24 and Software SPI. Do not use.<br>
\version 1.18 2014-06-02<br>
             Improvements to performance of RH_NRF24 statusRead, allowing RH_NRF24 and Software SPI
             to operate on slow devices like Arduino Uno.<br>
\version 1.19 2014-06-19<br>
             Added examples ask_transmitter.pde and ask_receiver.pde.<br>
             Fixed an error in the RH_RF22 doc for connection of Teensy to RF22.<br>
             Improved documentation of start symbol bit patterns in RH_ASK.cpp
\version 1.20 2014-06-24<br>
             Fixed a problem with compiling on platforms such as ATTiny where SS is not defined.<br>
             Added YIELD to RHMesh::recvfromAckTimeout().<br>
\version 1.21 2014-06-24<br>
             Fixed an issue in RH_Serial where characters might be lost with back-to-back frames.
             Suggested by Steve Childress.<br>
             Brought previous RHutil/crc16.h code into mainline RHCRC.cpp to prevent name collisions
             with other similarly named code in other libraries. Suggested by Steve Childress.<br>
             Fix SPI bus speed errors on 8MHz Arduinos.
\version 1.22 2014-07-01<br>
             Update RH_ASK documentation for common wiring connections.<br>
             Testing RH_ASK with HopeRF RFM83C/RFM85 courtesy Anarduino http://www.anarduino.com/<br>
             Testing RH_NRF24 with Itead Studio IBoard Pro http://imall.iteadstudio.com/iboard-pro.html
             using both hardware SPI on the ITDB02 Parallel LCD Module Interface pins and software SPI
             on the nRF24L01+ Module Interface pins. Documented wiring required.<br>
             Added support for AVR 1284 and 1284p, contributed by Peter Scargill.
             Added support for Semtech SX1276/77/78 and HopeRF RFM95/96/97/98 and other similar LoRa capable radios
             in LoRa mode only. Tested with the excellent MiniWirelessLoRa from
             Anarduino http://www.anarduino.com/miniwireless<br>
\version 1.23 2014-07-03<br>
             Changed the default modulation for RH_RF69 to GFSK_Rb250Fd250, since the previous default
             was not very reliable.<br>
             Documented RH_RF95 range tests.<br>
             Improvements to RH_RF22 RSSI readings so that lastRssi correctly returns the last message in dBm.<br>
\version 1.24 2014-07-18
             Added support for building RadioHead for STM32F4 Discovery boards, using the native STM Firmware libraries,
             in order to support Codec2WalkieTalkie (http://www.airspayce.com/mikem/Codec2WalkieTalkie)
             and other projects. See STM32ArduinoCompat.<br>
             Default modulation for RH_RF95 was incorrectly set to a very slow Bw125Cr48Sf4096
\version 1.25 2014-07-25
             The available() function will longer terminate any current transmission, and force receive mode.
             Now, if there is no unprocessed incoming message and an outgoing message is currently being transmitted,
             available() will return false.<br>
             RHRouter::sendtoWait(uint8_t*, uint8_t, uint8_t, uint8_t) renamed to sendtoFromSourceWait due to conflicts
             with new sendtoWait() with optional flags.<br>
             RHMEsh and RHRouter already supported end-to-end application layer flags, but RHMesh::sendtoWait()
             and RHRouter::sendToWait have now been extended to expose a way to send optional application layer flags.
\version 1.26 2014-08-12
             Fixed a Teensy 2.0 compile problem due yield() not available on Teensy < 3.0. <br>
             Adjusted the algorithm of RH_RF69::temperatureRead() to more closely reflect reality.<br>
             Added functions to RHGenericDriver to get driver packet statistics: rxBad(), rxGood(), txGood().<br>
             Added RH_RF69::printRegisters().<br>
             RH_RF95::printRegisters() was incorrectly printing the register index instead of the address.
             Reported by Phang Moh Lim.<br>
             RH_RF95, added definitions for some more registers that are usable in LoRa mode.<br>
             RH_RF95::setTxPower now uses RH_RF95_PA_DAC_ENABLE to achieve 21, 22 and 23dBm.<br>
             RH_RF95, updated power output measurements.<br>
             Testing RH_RF69 on Teensy 3.1 with RF69 on PJRC breakout board. OK.<br>
             Improvements so RadioHead will build under Arduino where SPI is not supported, such as
             ATTiny.<br>
             Improvements so RadioHead will build for ATTiny using Arduino IDE and tinycore arduino-tiny-0100-0018.zip.<br>
             Testing RH_ASK on ATTiny85. Reduced RAM footprint.
             Added helpful documentation. Caution: RAM memory is *very* tight on this platform.<br>
             RH_RF22 and RH_RF69, added setIdleMode() function to allow the idle mode radio operating state
             to be controlled for lower idle power consumption at the expense of slower transitions to TX and RX.<br>
\version 1.27 2014-08-13
             All RH_RF69 modulation schemes now have data whitening enabled by default.<br>
             Tested and added a number of OOK modulation schemes to RH_RF69 Modem config table.<br>
             Minor improvements to a number of the faster RH_RF69 modulation schemes, but some slower ones
             are still not working correctly.<br>
\version 1.28 2014-08-20
             Added new RH_RF24 driver to support Si446x, RF24/26/26, RFM24/26/27 family of transceivers.
             Tested with the excellent
             Anarduino Mini and RFM24W and RFM26W with the generous assistance of the good people at
             Anarduino http://www.anarduino.com.
\version 1.29 2014-08-21
             Fixed a compile error in RH_RF24 introduced at the last minute in hte previous release.<br>
             Improvements to RH_RF69 modulation schemes: now include the AFCBW in teh ModemConfig.<br>
             ModemConfig RH_RF69::FSK_Rb2Fd5 and RH_RF69::GFSK_Rb2Fd5 are now working.<br>
\version 1.30 2014-08-25
             Fixed some compile problems with ATtiny84 on Arduino 1.5.5 reported by Glen Cook.<br>
\version 1.31 2014-08-27
             Changed RH_RF69 FSK and GFSK modulations from Rb2_4Fd2_4 to Rb2_4Fd4_8 and FSK_Rb4_8Fd4_8 to FSK_Rb4_8Fd9_6
             since the previous ones were unreliable (they had modulation indexes of 1).<br>
\version 1.32 2014-08-28
             Testing with RedBearLab Blend board http://redbearlab.com/blend/. OK.<br>
             Changed more RH_RF69 FSK and GFSK slowish modulations to have modulation index of 2 instead of 1.
             This required chnaging the symbolic names.<br>
\version 1.33 2014-09-01
             Added support for sleep mode in RHGeneric driver, with new mode
             RHModeSleep and new virtual function sleep().<br>
             Added support for sleep to RH_RF69, RH_RF22, RH_NRF24, RH_RF24, RH_RF95 drivers.<br>
\version 1.34 2014-09-19
             Fixed compile errors in example rf22_router_test.<br>
             Fixed a problem with RH_NRF24::setNetworkAddress, also improvements to RH_NRF24 register printing.
             Patched by Yveaux.<br>
             Improvements to RH_NRF24 initialisation for version 2.0 silicon.<br>
             Fixed problem with ambigiguous print call in RH_RFM69 when compiling for Codec2.<br>
             Fixed a problem with RH_NRF24 on RFM73 where the LNA gain was not set properly, reducing the sensitivity
             of the receiver.
\version 1.35 2014-09-19
             Fixed a problem with interrupt setup on RH_RF95 with Teensy3.1. Reported by AD.<br>
\version 1.36 2014-09-22
             Improvements to interrupt pin assignments for __AVR_ATmega1284__ and__AVR_ATmega1284P__, provided by
             Peter Scargill.<br>
             Work around a bug in Arduino 1.0.6 where digitalPinToInterrupt is defined but NOT_AN_INTERRUPT is not.<br>
 \version 1.37 2014-10-19
             Updated doc for connecting RH_NRF24 to Arduino Mega.<br>
             Changes to RHGenericDriver::setHeaderFlags(), so that the default for the clear argument
             is now RH_FLAGS_APPLICATION_SPECIFIC, which is less surprising to users.
             Testing with the excellent MoteinoMEGA from LowPowerLab
             https://lowpowerlab.com/shop/moteinomega with on-board RFM69W.
 \version 1.38 2014-12-29
             Fixed compile warning on some platforms where RH_RF24::send and RH_RF24::writeTxFifo
             did not return a value.<br>
             Fixed some more compiler warnings in RH_RF24 on some platforms.<br>
             Refactored printRegisters for some radios. Printing to Serial
             is now controlled by the definition of RH_HAVE_SERIAL.<br>
             Added partial support for ARM M4 w/CMSIS with STM's Hardware Abstraction lib for
             Steve Childress.<br>
 \version 1.39 2014-12-30
             Fix some compiler warnings under IAR.<br>
             RH_HAVE_SERIAL and Serial.print calls removed for ATTiny platforms.<br>
 \version 1.40 2015-03-09
             Added notice about availability on PlatformIO, thanks to Ivan Kravets.<br>
             Fixed a problem with RH_NRF24 where short packet lengths would occasionally not be trasmitted
             due to a race condition with RH_NRF24_TX_DS. Reported by Mark Fox.<br>
 \version 1.41 2015-03-29
             RH_RF22, RH_RF24, RH_RF69 and RH_RF95 improved to allow driver.init() to be called multiple
             times without reallocating a new interrupt, allowing the driver to be reinitialised
             after sleeping or powering down.
 \version 1.42 2015-05-17
             Added support for RH_NRF24 driver on Raspberry Pi, using BCM2835
             library for GPIO pin IO. Contributed by Mike Poublon.<br>
             Tested RH_NRF24 module with NRF24L01+PA+LNA SMA Antenna Wireless Transceiver modules
             similar to: http://www.elecfreaks.com/wiki/index.php?title=2.4G_Wireless_nRF24L01p_with_PA_and_LNA
             works with no software changes. Measured max power output 18dBm.<br>
 \version 1.43 2015-08-02
             Added RH_NRF51 driver to support Nordic nRF51 family processor with 2.4GHz radio such
             as nRF51822, to be built on Arduino 1.6.4 and later. Tested with RedBearLabs nRF51822 board
             and BLE Nano kit<br>
 \version 1.44 2015-08-08
             Fixed errors with compiling on some platforms without serial, such as ATTiny.
             Reported by Friedrich Müller.<br>
 \version 1.45 2015-08-13
             Added support for using RH_Serial on Linux and OSX (new class RHutil/HardwareSerial
             encapsulates serial ports on those platforms). Example examples/serial upgraded
             to build and run on Linux and OSX using the tools/simBuild builder.
             RHMesh, RHRouter and RHReliableDatagram updated so they can use RH_Serial without
             polling loops on Linux and OSX for CPU efficiency.<br>
 \version 1.46 2015-08-14
             Amplified some doc concerning Linux and OSX RH_Serial. Added support for 230400
             baud rate in HardwareSerial.<br>
             Added sample sketches nrf51_audio_tx and nrf51_audio_rx which show how to
             build an audio TX/RX pair with RedBear nRF51822 boards and a SparkFun MCP4725 DAC board.
             Uses the built-in ADC of the nRF51822 to sample audio at 5kHz and transmit packets
             to the receiver which plays them via the DAC.<br>
\version 1.47 2015-09-18
             Removed top level Makefile from distribution: its only used by the developer and
             its presence confuses some people.<br>
             Fixed a problem with RHReliableDatagram with some versions of Raspberry Pi random() that causes
             problems: random(min, max) sometimes exceeds its max limit.
\version 1.48 2015-09-30
             Added support for Arduino Zero. Tested on Arduino Zero Pro.
\version 1.49 2015-10-01
             Fixed problems that prevented interrupts working correctly on Arduino Zero and Due.
             Builds and runs with 1.6.5 (with 'Arduino SAMD Boards' for Zero version 1.6.1) from arduino.cc.
             Arduino version 1.7.7 from arduino.org is not currently supported.
\version 1.50 2015-10-25
             Verified correct building and operation with Arduino 1.7.7 from arduino.org.
             Caution: You must burn the bootloader from 1.7.7 to the Arduino Zero before it will
             work with Arduino 1.7.7 from arduino.org. Conversely, you must burn the bootloader from 1.6.5
             to the Arduino Zero before it will
             work with Arduino 1.6.5 from arduino.cc. Sigh.
             Fixed a problem with RH_NRF905 that prevented the power and frequency ranges being set
             properly. Reported by Alan Webber.
\version 1.51 2015-12-11
             Changes to RH_RF6::setTxPower() to be compatible with SX1276/77/78/79 modules that
             use RFO transmitter pins instead of PA_BOOST, such as the excellent
             Modtronix inAir4 http://modtronix.com/inair4.html
             and inAir9 modules http://modtronix.com/inair9.html. With the kind assistance of
             David from Modtronix.
\version 1.52 2015-12-17
             Added RH_MRF89 module to suport Microchip MRF89XA and compatible transceivers.
             and modules.<br>
\version 1.53 2016-01-02
             Added RH_CC110 module to support Texas Instruments CC110L and compatible transceivers and modules.<br>
\version 1.54 2016-01-29
             Added support for ESP8266 processor on Arduino IDE. Examples serial_reliable_datagram_* are shown to work.
             CAUTION: SPI not supported yet. Timers used by RH_ASK are not tested.
             The GHz radio included in the ESP8266 is not yet supported.
\version 1.55 2016-02-12
             Added macros for htons() and friends to RadioHead.h.
             Added example sketch serial_gateway.pde. Acts as a transparent gateway between RH_RF22 and RH_Serial,
             and with minor mods acts as a universal gateway between any 2 RadioHead driver networks.
             Initial work on supporting STM32 F2 on Particle Photon: new platform type defined.
             Fixed many warnings exposed by test building for Photon.
