amamory/stm32f10x_makefile_freertos/RadioHead-1.97/RadioHead.h
\version 1.90 2019-05-21
             Fixed a block size error in RhEncryptedDriver for the case when
             using STRICT_CONTENT_LEN and sending messages of exactly _blockcipher.blockSize() bytes in length.
	     Reported and patched by Philippe Rochat.
             Patch from Samuel Archibald to prevent compile errors with RH_AAK.cpp fo ATSAMD51.
	     Fixed a probem in RH_RF69::setSyncWords that prevented setSyncWords(NULL, 0) correctly
	     disabling sync detection and generation. Reported by Federico Maggi.
	     RHHardwareSPI::usingInterrupt() was a noop. Fixed to call SPI.usingInterrupt(interrupt);.

\version 1.91 2019-06-01
             Fixed a problem with new RHHardwareSPI::usingInterrupt() that prevented compilation on ESP8266
	     which does not have that call.

\version 1.92 2019-07-14
             Retested serial_reliable_datagram_client.pde and serial_reliable_datagram_server.pde built on Linux
	     as described in their headers, and with USB-RS485 adapters. No changes, working correctly.
	     Testing of nRF5232 with Sparkfun nRF52 board support 0.2.3 shows that there appears to be a problem with
	     interrupt handlers on this board, and none of the interrupt based radio drivers can be expected to work
	     with this chip.
	     Ensured all interrupt routines are flagged with ICACHE_RAM_ATTR when compiled for ESP8266, to prevent crashes.

\version 1.94 2019-09-02
             Fixed a bug in RHSoftwareSPI where RHGenericSPI::setBitOrder() has no effect for
	     on RHSoftwareSPI. Reported by Peter.<br>
	     Added support in RHRouter for a node to optionally be leaf node, and not participate as a router in the
	     network. See RHRouter::setNodeTypePatch from Alex Evans.<br>
	     Fixed a problem with ESP32 causing compile errors over missing SPI.usingInterrupt().<br>

\version 1.95 2019-10-14
             Fixed some typos in RH_RF05.h macro definitions reported by Clayton Smith.<br>
	     Patch from Michael Cain from RH_ASK on ESP32, untested by me.<br>
	     Added support for RPi Zero and Zero W for the RF95, contributed by Brody Mahoney.
	     Not tested by me.<br>

\version 1.96 2019-10-14
             Added examples for RPi Zero and Zero W to examples/raspi/rf95, contributed by Brody Mahoney
	     not tested by me. <br>

\version 1.97 2019-11-02
             Added support for Mongoose OS, contributed by Paul Austen.

\author  Mike McCauley. DO NOT CONTACT THE AUTHOR DIRECTLY. USE THE GOOGLE LIST GIVEN ABOVE
*/

/*! \page packingdata
\par Passing Sensor Data Between RadioHead nodes

People often ask about how to send data (such as numbers, sensor
readings etc) from one RadioHead node to another. Although this issue
is not specific to RadioHead, and more properly lies in the area of
programming for networks, we will try to give some guidance here.

One reason for the uncertainty and confusion in this area, especially
amongst beginners, is that there is no *best* way to do it. The best
solution for your project may depend on the range of processors and
data that you have to deal with. Also, it gets more difficult if you
need to send several numbers in one packet, and/or deal with floating
point numbers and/or different types of processors.

The principal cause of difficulty is that different microprocessors of
the kind that run RadioHead may have different ways of representing
binary data such as integers. Some processors are little-endian and
some are big-endian in the way they represent multi-byte integers
(https://en.wikipedia.org/wiki/Endianness). And different processors
and maths libraries may represent floating point numbers in radically
different ways:
(https://en.wikipedia.org/wiki/Floating-point_arithmetic)

All the RadioHead examples show how to send and receive simple ASCII
strings, and if thats all you want, refer to the examples folder in
your RadioHead distribution.  But your needs may be more complicated
than that.

The essence of all engineering is compromise so it will be up to you to
decide whats best for your particular needs. The main choices are:
- Raw Binary
- Network Order Binary
- ASCII

\par Raw Binary

With this technique you just pack the raw binary numbers into the packet:

\code
// Sending a single 16 bit unsigned integer
// in the transmitter:
...
uint16_t data = getsomevalue();
if (!driver.send((uint8_t*)&data, sizeof(data)))
{
    ...
\endcode

\code
// and in the receiver:
...
uint16_t data;
uint8_t datalen = sizeof(data);
if (   driver.recv((uint8_t*)&data, &datalen)
    && datalen == sizeof(data))
{
    // Have the data, so do something with it
    uint16_t xyz = data;
    ...
\endcode

If you need to send more than one number at a time, its best to pack
them into a structure

\code
// Sending several 16 bit unsigned integers in a structure
// in a common header for your project:
typedef struct
{
    uint16_t   dataitem1;
    uint16_t   dataitem2;
} MyDataStruct;
...
\endcode

\code
// In the transmitter
...
MyDataStruct data;
data.dataitem1 = getsomevalue();
data.dataitem2 = getsomeothervalue();
if (!driver.send((uint8_t*)&data, sizeof(data)))
{
    ...
\endcode

\code
// in the receiver
MyDataStruct data;
uint8_t datalen = sizeof(data);
if (   driver.recv((uint8_t*)&data, &datalen)
    && datalen == sizeof(data))
{
    // Have the data, so do something with it
    uint16_t pqr = data.dataitem1;
    uint16_t xyz = data.dataitem2;
    ....
\endcode


The disadvantage with this simple technique becomes apparent if your
transmitter and receiver have different endianness: the integers you
receive will not be the same as the ones you sent (actually they are,
but with the internal bytes swapped around, so they probably wont make
sense to you). Endianness is not a problem if *every* data item you
send is a just single byte (uint8_t or int8_t or char), or if the
transmitter and receiver have the same endianness.

So you should only adopt this technique if:
- You only send data items of a single byte each, or
- You are absolutely sure (now and forever into the future) that you
will only ever use the same processor endianness in the transmitter and receiver.

